Autodesk.Revit.DB.TilePattern.TilesPerSeedNode
Get the number of tiles located at each seed node.
Remarks: Currently the number of tiles per seed node is
always either 1 or 2.

Autodesk.Revit.DB.TilePattern.TilePatternType
The built-in system tile pattern specified by
this object.

Autodesk.Revit.DB.TilePattern
An object representing a tile pattern that may
be applied to a DividedSurface.
Remarks: TilePatterns cannot be created.
A fixed selection is built into each Conceptual Mass
family. TilePatterns can be retrieved by key from the
Revit::DB::Document::Settings::TilePatternTable object.